Revit 2027 API
FabricationConfiguration.GetInsulationSpecificationName Method
 Gets the insulation specification name from its identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetInsulationSpecificationName(
	int specId
)
Public Function GetInsulationSpecificationName (
	specId As Integer
) As String
public:
String^ GetInsulationSpecificationName(
	int specId
)
member GetInsulationSpecificationName :
        specId : int -> string
Parameters
specId Int32
 The insulation specification identifier.
Return Value
String
 The insulation specification name.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace